---
kind: method
id: M:Autodesk.Revit.DB.VertexIndexPairArray.#ctor
source: html/c51d3ca9-4b78-d473-fe6b-b96a93204d9c.htm
---
# Autodesk.Revit.DB.VertexIndexPairArray.#ctor Method

Initializes a new instance of the VertexIndexPairArray class

## Syntax (C#)
```csharp
public VertexIndexPairArray()
```